/**
 * 业务错误码定义，值格式需要错误码:错误描述形式
 */
export enum ErrorEnum {
  CODE_500 = '500:服务繁忙，请稍后重试',
  CODE_1022 = '1022:登录账号或密码错误',
  CODE_1023 = '1023:输入的旧密码不一致',
  CODE_1024 = '1024:账号已被禁用',
  CODE_1029 = '1029:手机号已存在',
  CODE_1030 = '1030:用户不存在',

  //--------------------game
  CODE_1000 = '1000:游戏错误',
  CODE_1001 = '1001:游戏不存在',
  CODE_1002 = '1002:游戏余额不足',
  CODE_1003 = '1003:没有充值记录',

  //--------------------user
  CODE_2001 = '2001:资金账户不存在',

  //--------------------activity
  CODE_3001 = '3001:VIP奖励不存在',
  CODE_3002 = '3002:签到奖励不存在',
  CODE_3003 = '3002:宝箱不存在',
  CODE_3004 = '3004:宝箱已领取',
  CODE_3005 = '3005:抽奖次数不足',
  CODE_3006 = '3006:抽奖配置错误',
  CODE_3007 = '3007:任务配置错误',
  CODE_3008 = '3008:任务未完成',
  CODE_3009 = '3009:没有可以领取的救助金',

  //--------------------payment
  CODE_5130 = '1130:支付渠道不存在',
  CODE_5131 = '5131:CPF未配置',
  CODE_5132 = '5132:打码量不足',
  CODE_5133 = '5133:未配置CPF相关信息',
  CODE_5134 = '5134:存在未结束的提现申请',
  CODE_5135 = '5135:余额不足',
  CODE_5136 = '5136:提现出现错误，请联系客服',
  CODE_5137 = '5137:低于最低提现金额',
  CODE_5138 = '5138:高于最大单笔提现金额',
}
